/* ========================= [ 쿼리 연습 정답 ] ========================= */
/*
    1.  이름이 SMITH인 사원과 동일한 직급을 가진 사원들의
        사번, 사원 이름, 직급, 상사 사번,
        입사일, 급여, 커미션, 부서 번호 조회
        (단, 커미션이 존재하지 않을 경우 0으로 처리)
*/

/*
    2.  회사 평균 급여보다 급여가 적은 사원들의
        이름, 직급, 급여[, 회사 평균 급여] 조회
        (회사 평균 급여는 선택 사항이므로 자유롭게 조회)
*/

/*
    3.  급여가 제일 높은 사원의
        이름, 직급, 급여[, 최고 급여] 조회
        (최고 급여는 선택 사항이므로 자유롭게 조회)
*/

/*
    4.  KING 사원 이후 입사한 사원들의
        사원 이름, 직급, 입사일[, KING 사원 입사일] 조회
        (KING 사원 입사일은 선택 사항이므로 자유롭게 조회)
*/

/*
    5.  사원들의 사원 이름, 급여, 회사 평균 급여, 급여의 차 조회
        
    급여의 차 계산 :
        | 회사 평균 급여 - 각 사원의 급여 |
*/

/*
    6.  부서 별 급여의 합이 가장 높은 부서의
        사원들의 사원 이름, 직급, 부서 번호,
        부서 이름, 부서 급여 합계, 부서원 수 조회
*/

/*
    7.  커미션을 받는 사원이 존재하는 부서의
        사원들의 사원 이름, 직급, 부서 번호, 커미션 조회
*/

/*
    8.  회사 평균 급여보다 높은 급여이고, 이름이 4-5글자인 사원들의
        사원 이름, 급여, 이름글자수[, 회사 평균 급여] 조회
        (회사 평균 급여는 선택 사항이므로 자유롭게 조회)
*/

/*
    9.  사원 이름의 글자수가 4글자인 사원과 동일 직급을 가진 사원들의
        사원 이름, 직급, 급여 조회
*/

/*
    10. 입사년도가 81년이 아닌 사원과 같은 부서에 있는 사원들의
        사원 이름, 직급, 급여, 입사일, 부서번호 조회
*/

/*
    11. 직급 별 평균 급여 중, 하나이상 급여가 높은 사원들의
        사원 이름, 직급, 급여, 입사일 조회
*/

/*
    12. 입사 연도 별 평균 급여 중, 하나 이상 급여가 높은 사원들의
        사원 이름, 직급, 급여, 입사 년도 조회
*/

/*
    13. 급여가 가장 높은 사원과
        -   이름 글자수가 같은 직원이 존재하면
            모든 사원의 사원 이름, 이름 글자수, 직급, 급여 를 조회

        -   존재하지 않으면
            어떠한 정보도 조회하지 않음
*/